[
  {
    "id": 1,
    "title": "Understanding the three Toastmasters portals",
    "slug": "understanding-the-three-toastmasters-portals",
    "excerpt": "It can be quite confusing which portal to login to. Let's break down what each one does and who should use it.",
    "content": "It can be quite confusing which portal to login to because there are a few different systems when we talk about Toastmasters. Let's break down what each one does and who should use it.\n\n## Toastmasters.org - The Official Website\n\nThis is the official Toastmasters International website. Use this for:\n- Accessing your Pathways learning platform (Basecamp)\n- Working through your speech projects\n- Paying membership dues and renewals\n- Tracking your educational progress\n- Accessing Toastmasters resources and magazines\n\nALL members should log into this regularly to work on their Pathways.\n\n## Club Central (EasySpeak) - Our Club Management Platform\n\nClub Central, also known as EasySpeak, is our club management platform at toastmasterclub.org. Most members use this portal!\n\nUse this for:\n- Signing up for meeting roles\n- Requesting speech slots\n- Viewing meeting agendas\n- Seeing who else is attending meetings\n- Finding member contact information\n- (Officers only) Managing club roster and reports\n\nThis is your hub for meeting planning and participation.\n\n## Admin Panel - Website Management\n\nThe mlptoastmasters.org/admin panel is for website administrators and the VP Public Relations only. This is where club content on our public website is managed.\n\n## In Summary\n\n- **Toastmasters.org** for your learning\n- **EasySpeak** for our club meetings\n- You probably won't need the admin panel unless you're managing website content\n\nFor direct links to each portal, see our [login guide page](/login).",
    "author": "MLP Toastmasters",
    "authorBio": null,
    "category": "Getting Started",
    "tags": ["Getting Started", "EasySpeak", "Portals"],
    "publishedAt": "2025-11-15T00:00:00.000Z",
    "readTime": 4,
    "featuredImage": null,
    "featured": true,
    "viewCount": 0
  },
  {
    "id": 2,
    "title": "How to record your speech progress in EasySpeak",
    "slug": "how-to-record-speech-progress-easyspeak",
    "excerpt": "A step-by-step guide to recording your workbook assignments after giving a speech.",
    "content": "After giving a speech, it's important to record your workbook assignment so your progress counts officially. Here's how to do it step by step.\n\n## Step-by-Step Guide\n\n1. Log into toastmasterclub.org with your account\n2. Navigate to \"My Assignments\" (look for this in the menu)\n3. Select your educational pathway (e.g., Presentation Mastery, Dynamic Leadership)\n4. Choose your current level and project\n5. Mark the speech as completed\n6. Add your speech title\n7. Save your changes\n\n## Why It Matters\n\nWithout workbook assignments allocated to your speeches, your progress isn't officially recorded with Toastmasters International. This affects:\n\n- Your pathway completion tracking\n- Level advancement recognition\n- Eligibility for awards and designations\n- Club Distinguished Club Programme goals\n\nMake it a habit to record your speeches right after each meeting!\n\n## Getting Help\n\nIf you're not sure about your workbook assignment or need help navigating EasySpeak, reach out in the member group chat or ask any committee member at the next meeting. We're here to help!",
    "author": "MLP Toastmasters",
    "authorBio": null,
    "category": "Education",
    "tags": ["Education", "EasySpeak", "Progress"],
    "publishedAt": "2025-10-28T00:00:00.000Z",
    "readTime": 3,
    "featuredImage": null,
    "featured": false,
    "viewCount": 0
  },
  {
    "id": 3,
    "title": "Speech every 2-3 meetings: why regular practice matters",
    "slug": "speech-frequency-regular-practice-matters",
    "excerpt": "Discover why giving a speech every 2-3 meetings accelerates your progress and how our club size works in your favour.",
    "content": "One of the biggest advantages of our club is the regular speaking opportunities available. Here's why you should aim to give a speech every 2-3 meetings.\n\n## The Practice Principle\n\nPublic speaking is a skill that improves with practice. The more speeches you give, the quicker you progress through your Pathways and the faster you see improvement in your skills.\n\nAs our club emphasises: \"We should all be taking up available speaking slot opportunities. We only learn and improve by doing.\"\n\n## Club Size Advantage\n\nLarger clubs don't offer the speech opportunities we do. In bigger clubs, members might wait weeks or even months between speeches due to competition for slots. Our club size means more chances for you to speak and grow.\n\n## Planning Ahead\n\nUse EasySpeak to request speech slots well in advance. If it has been longer than two meetings since your last speech, start planning your next one. You can request slots across multiple meetings to stay on track.\n\n## Progression Speed\n\nMembers who speak regularly progress faster through their pathways. Some members give speeches at 4+ consecutive meetings! Whilst that's not required, it shows what's possible when you commit to regular practice.\n\n## Conclusion\n\nTake advantage of our club's speaking opportunities. Your future self will thank you for the accelerated growth and increased confidence.",
    "author": "MLP Toastmasters",
    "authorBio": null,
    "category": "Speeches",
    "tags": ["Speeches", "Practice", "Progress"],
    "publishedAt": "2025-11-10T00:00:00.000Z",
    "readTime": 4,
    "featuredImage": null,
    "featured": true,
    "viewCount": 0
  },
  {
    "id": 4,
    "title": "Welcome to our new home at St Christopher's Inn",
    "slug": "new-home-st-christophers-inn",
    "excerpt": "We're delighted to announce that we have permanent use of the private room at St Christopher's Inn!",
    "content": "We're delighted to announce that we have permanent use of the private room at St Christopher's Inn! This is our new club home.\n\n## What This Means\n\nHaving a permanent, dedicated space provides:\n- Consistent meeting location - no more moving around\n- Private room for focused meetings\n- Comfortable environment for learning\n- Reliable venue you can count on\n- Professional setting for our activities\n\n## Meeting Details\n\nFind us every Tuesday at 6:30pm in the private room at St Christopher's Inn. The space provides everything we need for productive meetings and a welcoming atmosphere for members and guests.\n\n## Post-Meeting Socials\n\nOur venue location also makes it easy to continue conversations after meetings. We often stay for drinks and socialising, giving members a chance to connect beyond the structured meeting format.\n\n## Conclusion\n\nWhether you're a long-time member or considering visiting for the first time, we're excited to welcome you to our club home at St Christopher's Inn!",
    "author": "MLP Toastmasters",
    "authorBio": null,
    "category": "Club News",
    "tags": ["Club News", "Venue", "Meetings"],
    "publishedAt": "2025-11-05T00:00:00.000Z",
    "readTime": 3,
    "featuredImage": null,
    "featured": true,
    "viewCount": 0
  },
  {
    "id": 5,
    "title": "Taking your first meeting role",
    "slug": "taking-your-first-meeting-role",
    "excerpt": "New members can start participating in meeting roles right away. Here's what you need to know.",
    "content": "New members often wonder when they can start participating in meeting roles. The answer might surprise you: right away!\n\n## Roles for New Members\n\nEven if you just joined, you can volunteer for roles like:\n- **Timer**: Track speaking times for all speakers\n- **Grammarian**: Listen for good language use and interesting words\n- **Ah-Counter**: Note filler words and sounds\n\nThese roles help you engage with the meeting whilst learning how Toastmasters meetings work.\n\n## Support Available\n\nYou won't be doing this alone. We'll guide and support you through any role:\n- Explanations of what to do before the meeting\n- Role descriptions and tips provided\n- Experienced members nearby to help\n- Friendly, supportive atmosphere\n\n## Why Participate\n\nTaking meeting roles helps you:\n- Feel part of the club community faster\n- Understand meeting structure from the inside\n- Develop leadership and organisational skills\n- Build confidence before giving speeches\n- Contribute to smooth meeting operations\n\n## Real Member Experience\n\nMany of our newest members have jumped in to help with roles, and they've consistently found it a positive experience. As one member said after volunteering: \"Thanks for everyone's support, really enjoyed it!\"\n\n## Getting Started\n\nTalk to the VP Education or indicate your interest on EasySpeak. We'll match you with a role that fits your comfort level and provide all the guidance you need.",
    "author": "MLP Toastmasters",
    "authorBio": null,
    "category": "Getting Started",
    "tags": ["Getting Started", "Roles", "New Members"],
    "publishedAt": "2025-10-20T00:00:00.000Z",
    "readTime": 4,
    "featuredImage": null,
    "featured": false,
    "viewCount": 0
  },
  {
    "id": 6,
    "title": "Contest season: what to expect",
    "slug": "contest-season-what-to-expect",
    "excerpt": "Twice a year, Toastmasters clubs hold contests. Here's what you need to know about participating.",
    "content": "Twice a year, Toastmasters clubs hold contests - exciting events where members showcase their speaking skills. Here's what contests involve.\n\n## Types of Contests\n\n### Table Topics Contest\nAll participants receive the same impromptu question and have 1-2 minutes to respond. This tests quick thinking and speaking skills.\n\n### Humorous Speech Contest\nMembers prepare 5-7 minute speeches designed to entertain and amuse the audience through humour.\n\n## Who Can Participate\n\nContests are open to all club members who meet eligibility requirements. We strongly encourage everyone to try Table Topics especially - it's just like doing a table topic at a regular meeting, except everyone gets the same question.\n\n## Roles Needed\n\nIf you're not competing, you can still participate by taking on contest roles:\n- Contest Chair (leads the event)\n- Timers (2 needed)\n- Ballot Counters (2 needed)\n- Voting Judges\n\nNote: You can only take roles if you're not participating as a contestant.\n\n## Contest Progression\n\nWinners advance from club level to area contests, then potentially to division and district levels. It's an excellent opportunity to challenge yourself and represent the club.\n\n## Support and Preparation\n\nThe club supports all contestants with practice opportunities and encouragement. Whether you win or not, participating builds valuable skills and confidence.",
    "author": "MLP Toastmasters",
    "authorBio": null,
    "category": "Contests",
    "tags": ["Contests", "Table Topics", "Speeches"],
    "publishedAt": "2025-10-15T00:00:00.000Z",
    "readTime": 4,
    "featuredImage": null,
    "featured": false,
    "viewCount": 0
  }
]
